pmo-dataset/variations/mermaid_with_ids/17.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Process payment"]
	Task_2["Confirm delivery"]
	Task_3["Receive back-order"]
	Task_4["Prepare\ndocumentation for\ninternational orders"]
	Task_5["Initiate back-order"]
	Task_6["Customer reports\nissue"]
	Task_7["Perform quality\ncontrol checks"]
	Task_8["Dispatch order"]
	Task_9["Check stock\navailability"]
	Task_10["Prepare shipping\ndocuments and labels"]
	Task_11["Process refund"]
	Task_12["Inspect returned\nitems"]
	Task_13["Notify about failed\npayment"]
	Task_14["Update inventory\nlevels"]
	Task_15["Gift wrap items"]
	Task_16["Inform customer\nabout delay"]
	Task_17["Send return shipping\nlabel"]
	Task_18["Process replacement"]
	Task_19["Pick items from\nwarehouse"]
	Task_20["Send shipping\nconfirmation to\ncustomer"]
	Task_21["Package items"]
	Task_22["Send follow-up email"]
	Task_23["Record order details"]
	Task_24["Receive returned\nitems"]
	Task_25["Place order"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"X"}
	ExclusiveGateway_8{"X"}
	ExclusiveGateway_9{"X"}
	ExclusiveGateway_10{"X"}
	ExclusiveGateway_11{"X"}
	ExclusiveGateway_12{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}

	ExclusiveGateway_5 --> Task_11
	Task_11 --> ExclusiveGateway_6
	ExclusiveGateway_6 --> ExclusiveGateway_10
	Task_9 --> ExclusiveGateway_9
	ParallelGateway_2 --> Task_21
	Task_3 --> ExclusiveGateway_3
	ExclusiveGateway_11 --> Task_9
	ExclusiveGateway_10 --> ExclusiveGateway_1
	ExclusiveGateway_7 --> ParallelGateway_3
	Task_17 --> Task_24
	Task_2 --> Task_22
	ExclusiveGateway_12 --> Task_6
	ExclusiveGateway_12 --> ExclusiveGateway_10
	ParallelGateway_1 --> Task_14
	Task_6 --> Task_17
	ExclusiveGateway_11 --> Task_13
	ParallelGateway_4 --> Task_2
	Task_12 --> ExclusiveGateway_5
	Task_7 --> ParallelGateway_2
	Task_14 --> ParallelGateway_4
	StartNoneEvent_1 --> Task_25
	Task_21 --> ExclusiveGateway_2
	ExclusiveGateway_4 --> ExclusiveGateway_8
	Task_20 --> ParallelGateway_4
	Task_13 --> ExclusiveGateway_1
	ExclusiveGateway_3 --> Task_19
	Task_19 --> Task_7
	Task_8 --> ParallelGateway_1
	ExclusiveGateway_1 --> EndNoneEvent_1
	ParallelGateway_1 --> Task_20
	ParallelGateway_3 --> Task_8
	ExclusiveGateway_2 --> ExclusiveGateway_7
	ExclusiveGateway_2 --> Task_15
	ExclusiveGateway_4 --> Task_4
	Task_15 --> ExclusiveGateway_7
	ExclusiveGateway_8 --> ParallelGateway_3
	Task_1 --> ExclusiveGateway_11
	Task_5 --> Task_16
	ParallelGateway_2 --> Task_10
	Task_23 --> Task_1
	Task_24 --> Task_12
	Task_18 --> ExclusiveGateway_6
	ExclusiveGateway_9 --> Task_5
	ExclusiveGateway_9 --> ExclusiveGateway_3
	ParallelGateway_2 --> ExclusiveGateway_4
	ExclusiveGateway_5 --> Task_18
	Task_10 --> ParallelGateway_3
	Task_16 --> Task_3
	Task_4 --> ExclusiveGateway_8
	Task_25 --> Task_23
	Task_22 --> ExclusiveGateway_12
